load_testing/tsung_editing_shopper.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
      <server host="goodshopping.eba-kvqpvst9.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="5" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="5" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="5" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="9" duration="5" unit="second">
      <users arrivalrate="256" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="10" duration="5" unit="second">
      <users arrivalrate="512" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>
    <session name="manufacturer" type="ts_http" weight="1">
<request><http method="GET" url="/"></http></request>
<request><http method="GET" url="/shoppers/new"></http></request>
<request><http method="POST" url="/shoppers" version="1.1" contents="shopper[username]=Shereen_User&amp;shopper[password]=Shereen&amp;shopper[name]=Shereen&amp;shopper[email]=shereen@gmail.pro&amp;shopper[telephone]=010101011"></http></request>
<thinktime value="8" random="true"></thinktime>
<request><http method="GET" url="/shoppers/1/edit"></http></request>
<request><http method="POST" url="/shoppers/edit/1" version="1.1" contents="shopper[email]=shereen1@gmail.pro&amp;shoppers[telephone]=121212111&amp;shoppers[address]=this is address"></http></request>
    </session>
  </sessions>
</tsung>